
var myChart = echarts.init(document.getElementById('youyi'));
option = {
    title:{ 
      text:'《长安三万里》中的诗歌对应的T-SNE图',
      textStyle: {
        fontSize: 12, // 标题字体大小
    },
     x:'center',
     y:'top',
    },
    
        xAxis: {},
        yAxis: {},
        tooltip: {
            trigger:'item',
            formatter:(params) => {  // params就是数据，这里可以打印一下看看
                // return 出去什么，鼠标移入就显示什么,marker就是提示前面蓝色的圆点
                return `${params.data[2]}</br>${params.marker}横坐标:${params.data[0]}</br>纵坐标:${params.data[1]}`
            }
        },
        series: [{
            symbolSize: 20,
       visualMap: [
        {
          min: 0,
          max: 1000,
          dimension: 4,
          inRange: {
            color: ['#000000', '#aabbcc', '#ffffff']
          }
        }],
     
            data: [   
      [1.4518 ,-1.7149 ,'《别董大》——高适'],
    [2.3140 ,	-1.8113,'《上李邕》——李白'], 
    [1.4507 	,-1.7086,'《登鹳雀楼》——王之涣' ],
    [-0.3277 	,-2.0574,'《黄鹤楼》——崔颢'] ,
    [1.4642 	,-1.8150,'《扶风豪士歌》——李白' ],
    [2.3404 	,-1.5484,'《采莲曲》——李白' ],
    [2.1011 ,	-1.9675,'《相思》——王维'], 
    [1.4390 	,-1.7853,'《落第长安》——常建'] ,
    [1.4797 	,-1.6284,'《白纻辞·其二》——李白'] ,
    [2.3130 ,	-1.8167,'《寄远十二首·其四》——李白'] ,
    [1.8140 ,	-1.9747,'《题玉泉溪》——湘驿女子' ],
    [2.0010 	,-1.9852 ,'《过故人庄》——孟浩然'],
    [2.3438 	,-1.7313,'《宋中十首·其一》——高适'] ,
    [2.3404 ,	-1.5484,'《静夜思》——李白'] ,
    [1.9210 	,-1.3812,'《春晓》——孟浩然'], 
    [-0.4138 ,	-2.0368,'《送孟浩然之广陵》——李白' ],
    [0.9367 ,	-1.8678,'《燕歌行》——高适'] ,
    [0.8631 ,	-1.8827,'《行路难其一》——李白'] ,
    [-0.9351 ,	-1.6326,'《南陵别儿童入京》——李白' ],
    [1.3780 	,-1.7861,'《忆旧游寄谯郡元参军》——李白' ],
    [1.8609 ,	-1.9803 ,'《别鲁颂》——李白'],
    [1.7949 	,-1.9750,'《望岳》——杜甫'], 
    [2.1258 ,	-1.9615,'《别刘大校书》——高适' ],
    [2.0825 	,-1.3963,'《采莲曲》——王昌龄' ],
    [0.1182 ,	-2.0317 ,'《出塞》——王昌龄'],
    [0.3229 	,-1.9919 ,'《白雪歌送武判官归京》——岑参'],
    [1.9211 	,-1.3800,'《前有一樽酒行二首》——李白' ],
    [-0.7728 ,	-1.8219,'《相和歌辞·采莲曲》——贺知章' ],
    [-0.3874 	,-2.0424,'《梦游天姥吟留别》——李白' ],
    [0.2913 ,	-1.9988,'《将进酒·君不见黄河之水天上来》——李白'] ,
    [1.4794 	,-1.6283,'《侠客行》——李白'], 
    [2.0418 ,	-1.3728,'《拟古十二首·其九》——李白' ],
    [2.3402 ,	-1.7412,'《赠汪伦》——李白' ],
    [-0.8275 ,	-1.7685,'《哥舒歌》——西鄙人' ],
    [1.9732 	,-1.3752,'《永王东巡歌十一首》——李白' ],
    [1.8940 ,	-1.3867,'《早发白帝城》——李白' ],
    [-0.3887 ,	-2.0422,'《子夜吴歌·秋歌》——李白' ],
    [1.1883 ,	-1.8170,'《代扶风主人答》——王昌龄' ],
    [-0.0580 ,	-2.0559,'《陇头吟》——王维' ],
    [-0.2863 	,-2.0619,'《别韦参军》——高适'] ,
    [2.1525 	,-1.4218,'《单父东楼秋夜送族弟沈之秦》——李白' ]
    
            ],
             itemStyle: {
              normal: {
                  color: function(params) {
                      // 根据数据点的 x 值设定颜色
                      var xValue = params.data[0];
                      var yValue = params.data[1];
                      if (xValue < -0.6) {
                          return 'Gold'; // 橙红色
                      } 
                       if (xValue < 0.33&&xValue>-0.5) {
                          return '		LimeGreen'; // 橙红色
                      } 
                      else if ((xValue < 1.47&&xValue>0.8)&&(yValue>-1.89&&yValue<1.7853))
                      {
                          return '		Indigo'; // 黄色
                      } 
                      else if ((xValue < 2.13&&xValue>1.79)&&(yValue>-1.99&&yValue<-1.96))
                      {
                        return'	OrangeRed'
                      }
                      else if ((xValue <2.35&&xValue>1.89)&&(yValue>-1.55&&yValue<1.35))
                      {
                        return'		Orchid'
                      }
                      else {
                          return '	CornflowerBlue'; // 深蓝色
                      }
                  }
              }
     },
            type: 'scatter'
        }]
    
    };
myChart.setOption(option);